*** src/server/jwks.rs:297:5: replace parse_algorithm -> Result<Algorithm> with Ok(Default::default())

*** mutation diff:
--- src/server/jwks.rs
+++ replace parse_algorithm -> Result<Algorithm> with Ok(Default::default())
@@ -289,29 +289,17 @@
             .ok_or_else(|| anyhow::anyhow!("No key found with kid: {kid}"))
     } else {
         keys.first()
             .ok_or_else(|| anyhow::anyhow!("JWKS has no keys"))
     }
 }
 
 fn parse_algorithm(algorithms: &[String]) -> Result<Algorithm> {
-    let alg = algorithms.first().map(|s| s.as_str()).unwrap_or("RS256");
-    match alg {
-        "RS256" => Ok(Algorithm::RS256),
-        "RS384" => Ok(Algorithm::RS384),
-        "RS512" => Ok(Algorithm::RS512),
-        "ES256" => Ok(Algorithm::ES256),
-        "ES384" => Ok(Algorithm::ES384),
-        "PS256" => Ok(Algorithm::PS256),
-        "PS384" => Ok(Algorithm::PS384),
-        "PS512" => Ok(Algorithm::PS512),
-        "EdDSA" => Ok(Algorithm::EdDSA),
-        _ => anyhow::bail!("Unsupported algorithm: {alg}"),
-    }
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn build_decoding_key(key: &Jwk) -> Result<DecodingKey> {
     match key.kty.as_str() {
         "RSA" => {
             let n = key
                 .n
                 .as_ref()

---- server::jwks::tests::test_parse_algorithm_eddsa stdout ----

thread 'server::jwks::tests::test_parse_algorithm_eddsa' (11259687) panicked at src/server/jwks.rs:390:9:
assertion `left == right` failed
  left: HS256
 right: EdDSA

---- server::jwks::tests::test_parse_algorithm_es384 stdout ----

thread 'server::jwks::tests::test_parse_algorithm_es384' (11259690) panicked at src/server/jwks.rs:366:9:
assertion `left == right` failed
  left: HS256
 right: ES384

---- server::jwks::tests::test_parse_algorithm_empty_defaults_to_rs256 stdout ----

thread 'server::jwks::tests::test_parse_algorithm_empty_defaults_to_rs256' (11259688) panicked at src/server/jwks.rs:404:9:
assertion `left == right` failed
  left: HS256
 right: RS256

failures:
    server::jwks::tests::test_parse_algorithm_eddsa
    server::jwks::tests::test_parse_algorithm_empty_defaults_to_rs256
    server::jwks::tests::test_parse_algorithm_es256
    server::jwks::tests::test_parse_algorithm_es384
    server::jwks::tests::test_parse_algorithm_ps256
    server::jwks::tests::test_parse_algorithm_ps384
    server::jwks::tests::test_parse_algorithm_ps512
    server::jwks::tests::test_parse_algorithm_rs256
    server::jwks::tests::test_parse_algorithm_rs384
    server::jwks::tests::test_parse_algorithm_rs512
    server::jwks::tests::test_parse_algorithm_unsupported

test result: FAILED. 139 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.28s

*** result: Failure(101)
