*** src/server/ssh.rs:62:51: replace && with || in parse_ssh_auth_header

*** mutation diff:
--- src/server/ssh.rs
+++ replace && with || in parse_ssh_auth_header
@@ -54,17 +54,17 @@
     let mut signature_bytes: Option<Vec<u8>> = None;
 
     for param in split_header_params(header) {
         let param = param.trim().to_string();
         if let Some((key, value)) = param.split_once('=') {
             let key = key.trim();
             // Strip surrounding quotes from the value.
             let value = value.trim();
-            let value = if value.starts_with('"') && value.ends_with('"') && value.len() >= 2 {
+            let value = if value.starts_with('"') || /* ~ changed by cargo-mutants ~ */ value.ends_with('"') && value.len() >= 2 {
                 &value[1..value.len() - 1]
             } else {
                 value
             };
 
             match key {
                 "fingerprint" => fingerprint = Some(value.to_string()),
                 "timestamp" => timestamp = Some(value.to_string()),

*** result: Success
