*** src/server/jwks.rs:299:9: delete match arm "RS256" in parse_algorithm

*** mutation diff:
--- src/server/jwks.rs
+++ delete match arm "RS256" in parse_algorithm
@@ -291,17 +291,17 @@
         keys.first()
             .ok_or_else(|| anyhow::anyhow!("JWKS has no keys"))
     }
 }
 
 fn parse_algorithm(algorithms: &[String]) -> Result<Algorithm> {
     let alg = algorithms.first().map(|s| s.as_str()).unwrap_or("RS256");
     match alg {
-        "RS256" => Ok(Algorithm::RS256),
+         /* ~ changed by cargo-mutants ~ */
         "RS384" => Ok(Algorithm::RS384),
         "RS512" => Ok(Algorithm::RS512),
         "ES256" => Ok(Algorithm::ES256),
         "ES384" => Ok(Algorithm::ES384),
         "PS256" => Ok(Algorithm::PS256),
         "PS384" => Ok(Algorithm::PS384),
         "PS512" => Ok(Algorithm::PS512),
         "EdDSA" => Ok(Algorithm::EdDSA),

---- server::jwks::tests::test_parse_algorithm_rs256 stdout ----

thread 'server::jwks::tests::test_parse_algorithm_rs256' (11260277) panicked at src/server/jwks.rs:353:59:
called `Result::unwrap()` on an `Err` value: Unsupported algorithm: RS256

---- server::jwks::tests::test_parse_algorithm_empty_defaults_to_rs256 stdout ----

thread 'server::jwks::tests::test_parse_algorithm_empty_defaults_to_rs256' (11260271) panicked at src/server/jwks.rs:415:40:
called `Result::unwrap()` on an `Err` value: Unsupported algorithm: RS256

failures:
    server::jwks::tests::test_parse_algorithm_empty_defaults_to_rs256
    server::jwks::tests::test_parse_algorithm_rs256

test result: FAILED. 148 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.29s

*** result: Failure(101)
