*** src/server/ssh.rs:62:90: replace >= with < in parse_ssh_auth_header

*** mutation diff:
--- src/server/ssh.rs
+++ replace >= with < in parse_ssh_auth_header
@@ -54,17 +54,17 @@
     let mut signature_bytes: Option<Vec<u8>> = None;
 
     for param in split_header_params(header) {
         let param = param.trim().to_string();
         if let Some((key, value)) = param.split_once('=') {
             let key = key.trim();
             // Strip surrounding quotes from the value.
             let value = value.trim();
-            let value = if value.starts_with('"') && value.ends_with('"') && value.len() >= 2 {
+            let value = if value.starts_with('"') && value.ends_with('"') && value.len() < /* ~ changed by cargo-mutants ~ */ 2 {
                 &value[1..value.len() - 1]
             } else {
                 value
             };
 
             match key {
                 "fingerprint" => fingerprint = Some(value.to_string()),
                 "timestamp" => timestamp = Some(value.to_string()),

---- server::ssh::tests::test_parse_unknown_keys_ignored stdout ----

thread 'server::ssh::tests::test_parse_unknown_keys_ignored' (11265357) panicked at src/server/ssh.rs:464:9:
assertion failed: parse_ssh_auth_header(&hdr).is_ok()

---- server::ssh::tests::test_parse_valid_header stdout ----

thread 'server::ssh::tests::test_parse_valid_header' (11265358) panicked at src/server/ssh.rs:420:61:
called `Result::unwrap()` on an `Err` value: Unauthorized("invalid signature base64: Invalid symbol 34, offset 0.")

---- server::ssh::tests::test_parse_empty_quoted_value stdout ----

thread 'server::ssh::tests::test_parse_empty_quoted_value' (11265347) panicked at src/server/ssh.rs:522:50:
called `Result::unwrap()` on an `Err` value: Unauthorized("invalid signature base64: Invalid symbol 34, offset 0.")

failures:
    server::ssh::tests::test_end_to_end_verify_succeeds
    server::ssh::tests::test_parse_empty_quoted_value
    server::ssh::tests::test_parse_unknown_keys_ignored
    server::ssh::tests::test_parse_valid_header
    server::ssh::tests::test_unknown_fingerprint_error_is_redacted
    server::ssh::tests::test_verify_drift_at_boundary_accepted
    server::ssh::tests::test_verify_drift_one_past_boundary_rejected
    server::ssh::tests::test_verify_rejects_expired_timestamp
    server::ssh::tests::test_verify_rejects_revoked_key
    server::ssh::tests::test_wrong_namespace_fails

test result: FAILED. 140 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.27s

*** result: Failure(101)
