*** src/server/ssh.rs:63:39: replace - with + in parse_ssh_auth_header

*** mutation diff:
--- src/server/ssh.rs
+++ replace - with + in parse_ssh_auth_header
@@ -55,17 +55,17 @@
 
     for param in split_header_params(header) {
         let param = param.trim().to_string();
         if let Some((key, value)) = param.split_once('=') {
             let key = key.trim();
             // Strip surrounding quotes from the value.
             let value = value.trim();
             let value = if value.starts_with('"') && value.ends_with('"') && value.len() >= 2 {
-                &value[1..value.len() - 1]
+                &value[1..value.len() + /* ~ changed by cargo-mutants ~ */ 1]
             } else {
                 value
             };
 
             match key {
                 "fingerprint" => fingerprint = Some(value.to_string()),
                 "timestamp" => timestamp = Some(value.to_string()),
                 "nonce" => nonce = Some(value.to_string()),

---- server::ssh::tests::test_parse_missing_fingerprint stdout ----

thread 'server::ssh::tests::test_parse_missing_fingerprint' (11265793) panicked at src/server/ssh.rs:63:23:
byte index 13 is out of bounds of `"1700000000"`

---- server::ssh::tests::test_parse_value_only_leading_quote stdout ----

thread 'server::ssh::tests::test_parse_value_only_leading_quote' (11265805) panicked at src/server/ssh.rs:63:23:
byte index 62 is out of bounds of `"SHA256:abc,timestamp="1700000000",nonce="n",signature="eA=="`

---- server::ssh::tests::test_parse_missing_signature stdout ----

thread 'server::ssh::tests::test_parse_missing_signature' (11265800) panicked at src/server/ssh.rs:63:23:
byte index 11 is out of bounds of `"SHA256:x"`

failures:
    server::ssh::tests::test_end_to_end_verify_succeeds
    server::ssh::tests::test_parse_empty_quoted_value
    server::ssh::tests::test_parse_missing_fingerprint
    server::ssh::tests::test_parse_missing_nonce
    server::ssh::tests::test_parse_missing_signature
    server::ssh::tests::test_parse_missing_timestamp
    server::ssh::tests::test_parse_unknown_keys_ignored
    server::ssh::tests::test_parse_valid_header
    server::ssh::tests::test_parse_value_only_leading_quote
    server::ssh::tests::test_unknown_fingerprint_error_is_redacted
    server::ssh::tests::test_verify_drift_at_boundary_accepted
    server::ssh::tests::test_verify_drift_one_past_boundary_rejected

test result: FAILED. 135 passed; 15 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.28s

*** result: Failure(101)
