*** src/server/jwks.rs:303:9: delete match arm "ES384" in parse_algorithm

*** mutation diff:
--- src/server/jwks.rs
+++ delete match arm "ES384" in parse_algorithm
@@ -295,17 +295,17 @@
 
 fn parse_algorithm(algorithms: &[String]) -> Result<Algorithm> {
     let alg = algorithms.first().map(|s| s.as_str()).unwrap_or("RS256");
     match alg {
         "RS256" => Ok(Algorithm::RS256),
         "RS384" => Ok(Algorithm::RS384),
         "RS512" => Ok(Algorithm::RS512),
         "ES256" => Ok(Algorithm::ES256),
-        "ES384" => Ok(Algorithm::ES384),
+         /* ~ changed by cargo-mutants ~ */
         "PS256" => Ok(Algorithm::PS256),
         "PS384" => Ok(Algorithm::PS384),
         "PS512" => Ok(Algorithm::PS512),
         "EdDSA" => Ok(Algorithm::EdDSA),
         _ => anyhow::bail!("Unsupported algorithm: {alg}"),
     }
 }

---- server::jwks::tests::test_parse_algorithm_es384 stdout ----

thread 'server::jwks::tests::test_parse_algorithm_es384' (11262123) panicked at src/server/jwks.rs:377:59:
called `Result::unwrap()` on an `Err` value: Unsupported algorithm: ES384

failures:
    server::jwks::tests::test_parse_algorithm_es384

test result: FAILED. 149 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.29s

*** result: Failure(101)
