*** src/server/ssh.rs:69:17: delete match arm "fingerprint" in parse_ssh_auth_header

*** mutation diff:
--- src/server/ssh.rs
+++ delete match arm "fingerprint" in parse_ssh_auth_header
@@ -61,17 +61,17 @@
             let value = value.trim();
             let value = if value.starts_with('"') && value.ends_with('"') && value.len() >= 2 {
                 &value[1..value.len() - 1]
             } else {
                 value
             };
 
             match key {
-                "fingerprint" => fingerprint = Some(value.to_string()),
+                 /* ~ changed by cargo-mutants ~ */
                 "timestamp" => timestamp = Some(value.to_string()),
                 "nonce" => nonce = Some(value.to_string()),
                 "signature" => {
                     let bytes = B64.decode(value).map_err(|e| {
                         AuthError::Unauthorized(format!("invalid signature base64: {e}"))
                     })?;
                     signature_bytes = Some(bytes);
                 }

---- server::ssh::tests::test_parse_empty_quoted_value stdout ----

thread 'server::ssh::tests::test_parse_empty_quoted_value' (11267196) panicked at src/server/ssh.rs:522:50:
called `Result::unwrap()` on an `Err` value: Unauthorized("missing fingerprint in SSH-Signature header")

---- server::ssh::tests::test_parse_value_no_quotes_unwrapped_directly stdout ----

thread 'server::ssh::tests::test_parse_value_no_quotes_unwrapped_directly' (11267211) panicked at src/server/ssh.rs:484:50:
called `Result::unwrap()` on an `Err` value: Unauthorized("missing fingerprint in SSH-Signature header")

---- server::ssh::tests::test_parse_unknown_keys_ignored stdout ----

thread 'server::ssh::tests::test_parse_unknown_keys_ignored' (11267209) panicked at src/server/ssh.rs:464:9:
assertion failed: parse_ssh_auth_header(&hdr).is_ok()

failures:
    server::ssh::tests::test_end_to_end_verify_succeeds
    server::ssh::tests::test_parse_empty_quoted_value
    server::ssh::tests::test_parse_unknown_keys_ignored
    server::ssh::tests::test_parse_valid_header
    server::ssh::tests::test_parse_value_no_quotes_unwrapped_directly
    server::ssh::tests::test_unknown_fingerprint_error_is_redacted
    server::ssh::tests::test_verify_drift_at_boundary_accepted
    server::ssh::tests::test_verify_drift_one_past_boundary_rejected
    server::ssh::tests::test_verify_rejects_expired_timestamp
    server::ssh::tests::test_verify_rejects_revoked_key
    server::ssh::tests::test_wrong_namespace_fails

test result: FAILED. 139 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.30s

*** result: Failure(101)
