*** src/server/jwks.rs:306:9: delete match arm "PS512" in parse_algorithm

*** mutation diff:
--- src/server/jwks.rs
+++ delete match arm "PS512" in parse_algorithm
@@ -298,17 +298,17 @@
     match alg {
         "RS256" => Ok(Algorithm::RS256),
         "RS384" => Ok(Algorithm::RS384),
         "RS512" => Ok(Algorithm::RS512),
         "ES256" => Ok(Algorithm::ES256),
         "ES384" => Ok(Algorithm::ES384),
         "PS256" => Ok(Algorithm::PS256),
         "PS384" => Ok(Algorithm::PS384),
-        "PS512" => Ok(Algorithm::PS512),
+         /* ~ changed by cargo-mutants ~ */
         "EdDSA" => Ok(Algorithm::EdDSA),
         _ => anyhow::bail!("Unsupported algorithm: {alg}"),
     }
 }
 
 fn build_decoding_key(key: &Jwk) -> Result<DecodingKey> {
     match key.kty.as_str() {
         "RSA" => {

---- server::jwks::tests::test_parse_algorithm_ps512 stdout ----

thread 'server::jwks::tests::test_parse_algorithm_ps512' (11263413) panicked at src/server/jwks.rs:395:59:
called `Result::unwrap()` on an `Err` value: Unsupported algorithm: PS512

failures:
    server::jwks::tests::test_parse_algorithm_ps512

test result: FAILED. 149 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.28s

*** result: Failure(101)
