*** src/server/ssh.rs:72:17: delete match arm "signature" in parse_ssh_auth_header

*** mutation diff:
--- src/server/ssh.rs
+++ delete match arm "signature" in parse_ssh_auth_header
@@ -64,22 +64,17 @@
             } else {
                 value
             };
 
             match key {
                 "fingerprint" => fingerprint = Some(value.to_string()),
                 "timestamp" => timestamp = Some(value.to_string()),
                 "nonce" => nonce = Some(value.to_string()),
-                "signature" => {
-                    let bytes = B64.decode(value).map_err(|e| {
-                        AuthError::Unauthorized(format!("invalid signature base64: {e}"))
-                    })?;
-                    signature_bytes = Some(bytes);
-                }
+                 /* ~ changed by cargo-mutants ~ */
                 _ => {} // ignore unknown keys
             }
         }
     }
 
     Ok(SshSignatureHeader {
         fingerprint: fingerprint.ok_or_else(|| {
             AuthError::Unauthorized("missing fingerprint in SSH-Signature header".into())

---- server::ssh::tests::test_parse_unknown_keys_ignored stdout ----

thread 'server::ssh::tests::test_parse_unknown_keys_ignored' (11268646) panicked at src/server/ssh.rs:459:9:
assertion failed: parse_ssh_auth_header(&hdr).is_ok()

---- server::ssh::tests::test_parse_value_no_quotes_unwrapped_directly stdout ----

thread 'server::ssh::tests::test_parse_value_no_quotes_unwrapped_directly' (11268648) panicked at src/server/ssh.rs:479:50:
called `Result::unwrap()` on an `Err` value: Unauthorized("missing signature in SSH-Signature header")

---- server::ssh::tests::test_parse_valid_header stdout ----

thread 'server::ssh::tests::test_parse_valid_header' (11268647) panicked at src/server/ssh.rs:415:61:
called `Result::unwrap()` on an `Err` value: Unauthorized("missing signature in SSH-Signature header")

failures:
    server::ssh::tests::test_end_to_end_verify_succeeds
    server::ssh::tests::test_parse_empty_quoted_value
    server::ssh::tests::test_parse_unknown_keys_ignored
    server::ssh::tests::test_parse_valid_header
    server::ssh::tests::test_parse_value_no_quotes_unwrapped_directly
    server::ssh::tests::test_unknown_fingerprint_error_is_redacted
    server::ssh::tests::test_verify_drift_at_boundary_accepted
    server::ssh::tests::test_verify_drift_one_past_boundary_rejected
    server::ssh::tests::test_verify_rejects_expired_timestamp
    server::ssh::tests::test_verify_rejects_revoked_key
    server::ssh::tests::test_wrong_namespace_fails

test result: FAILED. 139 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.27s

*** result: Failure(101)
