*** src/server/ssh.rs:65:17: delete match arm "nonce" in parse_ssh_auth_header

*** mutation diff:
--- src/server/ssh.rs
+++ delete match arm "nonce" in parse_ssh_auth_header
@@ -57,17 +57,17 @@
         let param = param.trim().to_string();
         if let Some((key, value)) = param.split_once('=') {
             let key = key.trim();
             let value = strip_surrounding_quotes(value.trim());
 
             match key {
                 "fingerprint" => fingerprint = Some(value.to_string()),
                 "timestamp" => timestamp = Some(value.to_string()),
-                "nonce" => nonce = Some(value.to_string()),
+                 /* ~ changed by cargo-mutants ~ */
                 "signature" => {
                     let bytes = B64.decode(value).map_err(|e| {
                         AuthError::Unauthorized(format!("invalid signature base64: {e}"))
                     })?;
                     signature_bytes = Some(bytes);
                 }
                 _ => {} // ignore unknown keys
             }

---- server::ssh::tests::test_parse_valid_header stdout ----

thread 'server::ssh::tests::test_parse_valid_header' (11470643) panicked at src/server/ssh.rs:427:61:
called `Result::unwrap()` on an `Err` value: Unauthorized("missing nonce in SSH-Signature header")

---- server::ssh::tests::test_parse_value_no_quotes_unwrapped_directly stdout ----

thread 'server::ssh::tests::test_parse_value_no_quotes_unwrapped_directly' (11470644) panicked at src/server/ssh.rs:491:50:
called `Result::unwrap()` on an `Err` value: Unauthorized("missing nonce in SSH-Signature header")

---- server::ssh::tests::test_parse_unknown_keys_ignored stdout ----

thread 'server::ssh::tests::test_parse_unknown_keys_ignored' (11470642) panicked at src/server/ssh.rs:471:9:
assertion failed: parse_ssh_auth_header(&hdr).is_ok()

failures:
    server::ssh::tests::test_end_to_end_verify_succeeds
    server::ssh::tests::test_parse_empty_quoted_value
    server::ssh::tests::test_parse_unknown_keys_ignored
    server::ssh::tests::test_parse_valid_header
    server::ssh::tests::test_parse_value_no_quotes_unwrapped_directly
    server::ssh::tests::test_unknown_fingerprint_error_is_redacted
    server::ssh::tests::test_verify_drift_at_boundary_accepted
    server::ssh::tests::test_verify_drift_one_past_boundary_rejected
    server::ssh::tests::test_verify_rejects_expired_timestamp
    server::ssh::tests::test_verify_rejects_revoked_key
    server::ssh::tests::test_wrong_namespace_fails

test result: FAILED. 148 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.32s

*** result: Failure(101)
