*** src/server/ssh.rs:104:5: replace split_header_params -> Vec<String> with vec![]

*** mutation diff:
--- src/server/ssh.rs
+++ replace split_header_params -> Vec<String> with vec![]
@@ -96,39 +96,17 @@
     })
 }
 
 /// Split a header value by commas while respecting double-quoted strings.
 ///
 /// A quoted string like `signature="a,b"` will not be split at the inner
 /// comma.
 pub fn split_header_params(header: &str) -> Vec<String> {
-    let mut parts = Vec::new();
-    let mut current = String::new();
-    let mut in_quotes = false;
-
-    for ch in header.chars() {
-        match ch {
-            '"' => {
-                in_quotes = !in_quotes;
-                current.push(ch);
-            }
-            ',' if !in_quotes => {
-                parts.push(current.trim().to_string());
-                current = String::new();
-            }
-            _ => current.push(ch),
-        }
-    }
-
-    if !current.trim().is_empty() {
-        parts.push(current.trim().to_string());
-    }
-
-    parts
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 // ──────────────────────────────────────────────────────────────────────────────
 // Task 3: Nonce tracker for replay protection
 // ──────────────────────────────────────────────────────────────────────────────
 
 /// Tracks seen nonces to prevent replay attacks.
 ///

---- server::ssh::tests::test_parse_unknown_keys_ignored stdout ----

thread 'server::ssh::tests::test_parse_unknown_keys_ignored' (11269068) panicked at src/server/ssh.rs:442:9:
assertion failed: parse_ssh_auth_header(&hdr).is_ok()

---- server::ssh::tests::test_parse_valid_header stdout ----

thread 'server::ssh::tests::test_parse_valid_header' (11269069) panicked at src/server/ssh.rs:398:61:
called `Result::unwrap()` on an `Err` value: Unauthorized("missing fingerprint in SSH-Signature header")

---- server::ssh::tests::test_parse_value_no_quotes_unwrapped_directly stdout ----

thread 'server::ssh::tests::test_parse_value_no_quotes_unwrapped_directly' (11269074) panicked at src/server/ssh.rs:462:50:
called `Result::unwrap()` on an `Err` value: Unauthorized("missing fingerprint in SSH-Signature header")

failures:
    server::ssh::tests::test_end_to_end_verify_succeeds
    server::ssh::tests::test_parse_empty_quoted_value
    server::ssh::tests::test_parse_unknown_keys_ignored
    server::ssh::tests::test_parse_valid_header
    server::ssh::tests::test_parse_value_no_quotes_unwrapped_directly
    server::ssh::tests::test_unknown_fingerprint_error_is_redacted
    server::ssh::tests::test_verify_drift_at_boundary_accepted
    server::ssh::tests::test_verify_drift_one_past_boundary_rejected
    server::ssh::tests::test_verify_rejects_expired_timestamp
    server::ssh::tests::test_verify_rejects_revoked_key
    server::ssh::tests::test_wrong_namespace_fails

test result: FAILED. 139 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.30s

*** result: Failure(101)
