*** src/server/ssh.rs:114:20: replace match guard !in_quotes with false in split_header_params

*** mutation diff:
--- src/server/ssh.rs
+++ replace match guard !in_quotes with false in split_header_params
@@ -106,17 +106,17 @@
     let mut in_quotes = false;
 
     for ch in header.chars() {
         match ch {
             '"' => {
                 in_quotes = !in_quotes;
                 current.push(ch);
             }
-            ',' if !in_quotes => {
+            ',' if false /* ~ changed by cargo-mutants ~ */ => {
                 parts.push(current.trim().to_string());
                 current = String::new();
             }
             _ => current.push(ch),
         }
     }
 
     if !current.trim().is_empty() {

---- server::ssh::tests::test_parse_unknown_keys_ignored stdout ----

thread 'server::ssh::tests::test_parse_unknown_keys_ignored' (11271426) panicked at src/server/ssh.rs:464:9:
assertion failed: parse_ssh_auth_header(&hdr).is_ok()

---- server::ssh::tests::test_parse_empty_quoted_value stdout ----

thread 'server::ssh::tests::test_parse_empty_quoted_value' (11271417) panicked at src/server/ssh.rs:522:50:
called `Result::unwrap()` on an `Err` value: Unauthorized("missing timestamp in SSH-Signature header")

---- server::ssh::tests::test_parse_value_no_quotes_unwrapped_directly stdout ----

thread 'server::ssh::tests::test_parse_value_no_quotes_unwrapped_directly' (11271428) panicked at src/server/ssh.rs:484:50:
called `Result::unwrap()` on an `Err` value: Unauthorized("missing timestamp in SSH-Signature header")

failures:
    server::ssh::tests::test_end_to_end_verify_succeeds
    server::ssh::tests::test_parse_empty_quoted_value
    server::ssh::tests::test_parse_unknown_keys_ignored
    server::ssh::tests::test_parse_valid_header
    server::ssh::tests::test_parse_value_no_quotes_unwrapped_directly
    server::ssh::tests::test_unknown_fingerprint_error_is_redacted
    server::ssh::tests::test_verify_drift_at_boundary_accepted
    server::ssh::tests::test_verify_drift_one_past_boundary_rejected
    server::ssh::tests::test_verify_rejects_expired_timestamp
    server::ssh::tests::test_verify_rejects_revoked_key
    server::ssh::tests::test_wrong_namespace_fails

test result: FAILED. 139 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.29s

*** result: Failure(101)
