*** src/server/ssh.rs:122:8: delete ! in split_header_params

*** mutation diff:
--- src/server/ssh.rs
+++ delete ! in split_header_params
@@ -114,17 +114,17 @@
             ',' if !in_quotes => {
                 parts.push(current.trim().to_string());
                 current = String::new();
             }
             _ => current.push(ch),
         }
     }
 
-    if !current.trim().is_empty() {
+    if  /* ~ changed by cargo-mutants ~ */current.trim().is_empty() {
         parts.push(current.trim().to_string());
     }
 
     parts
 }
 
 // ──────────────────────────────────────────────────────────────────────────────
 // Task 3: Nonce tracker for replay protection

---- server::ssh::tests::test_parse_empty_quoted_value stdout ----

thread 'server::ssh::tests::test_parse_empty_quoted_value' (11276144) panicked at src/server/ssh.rs:522:50:
called `Result::unwrap()` on an `Err` value: Unauthorized("missing signature in SSH-Signature header")

---- server::ssh::tests::test_parse_value_no_quotes_unwrapped_directly stdout ----

thread 'server::ssh::tests::test_parse_value_no_quotes_unwrapped_directly' (11276151) panicked at src/server/ssh.rs:484:50:
called `Result::unwrap()` on an `Err` value: Unauthorized("missing signature in SSH-Signature header")

---- server::ssh::tests::test_parse_valid_header stdout ----

thread 'server::ssh::tests::test_parse_valid_header' (11276150) panicked at src/server/ssh.rs:420:61:
called `Result::unwrap()` on an `Err` value: Unauthorized("missing signature in SSH-Signature header")

failures:
    server::ssh::tests::test_end_to_end_verify_succeeds
    server::ssh::tests::test_parse_empty_quoted_value
    server::ssh::tests::test_parse_valid_header
    server::ssh::tests::test_parse_value_no_quotes_unwrapped_directly
    server::ssh::tests::test_unknown_fingerprint_error_is_redacted
    server::ssh::tests::test_verify_drift_at_boundary_accepted
    server::ssh::tests::test_verify_drift_one_past_boundary_rejected
    server::ssh::tests::test_verify_rejects_expired_timestamp
    server::ssh::tests::test_verify_rejects_revoked_key
    server::ssh::tests::test_wrong_namespace_fails

test result: FAILED. 140 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.28s

*** result: Failure(101)
