*** src/server/jwks.rs:213:17: replace > with >= in cache_entry_is_fresh

*** mutation diff:
--- src/server/jwks.rs
+++ replace > with >= in cache_entry_is_fresh
@@ -205,17 +205,17 @@
     }
 }
 
 /// Pure predicate for the validation-cache hit check. Extracted from
 /// [`JwksManager::validate_jwt`] so the comparison is exercised directly
 /// by unit tests -- mutation operators (`>` -> `<`, `>=`, `==`) are pinned
 /// by `test_cache_entry_is_fresh_*`.
 fn cache_entry_is_fresh(valid_until: Instant, now: Instant) -> bool {
-    valid_until > now
+    valid_until >= /* ~ changed by cargo-mutants ~ */ now
 }
 
 /// Pure predicate for the JWKS cache hit decision. Extracted so the two
 /// boundary comparisons (`< JWKS_CACHE_TTL` and `>= KID_MISS_REFRESH_COOLDOWN`)
 /// are pinned by unit tests. Returns true when the cached keys can be
 /// returned directly (no refetch needed).
 ///
 /// Logic: use the cache iff it is *fresh* (within TTL) AND either the kid

---- server::jwks::tests::test_cache_entry_is_fresh_equal_is_false stdout ----

thread 'server::jwks::tests::test_cache_entry_is_fresh_equal_is_false' (11364313) panicked at src/server/jwks.rs:732:9:
assertion failed: !cache_entry_is_fresh(now, now)

failures:
    server::jwks::tests::test_cache_entry_is_fresh_equal_is_false

test result: FAILED. 158 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.31s

*** result: Failure(101)
