*** src/server/jwks.rs:213:5: replace cache_entry_is_fresh -> bool with true

*** mutation diff:
--- src/server/jwks.rs
+++ replace cache_entry_is_fresh -> bool with true
@@ -205,17 +205,17 @@
     }
 }
 
 /// Pure predicate for the validation-cache hit check. Extracted from
 /// [`JwksManager::validate_jwt`] so the comparison is exercised directly
 /// by unit tests -- mutation operators (`>` -> `<`, `>=`, `==`) are pinned
 /// by `test_cache_entry_is_fresh_*`.
 fn cache_entry_is_fresh(valid_until: Instant, now: Instant) -> bool {
-    valid_until > now
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// Pure predicate for the JWKS cache hit decision. Extracted so the two
 /// boundary comparisons (`< JWKS_CACHE_TTL` and `>= KID_MISS_REFRESH_COOLDOWN`)
 /// are pinned by unit tests. Returns true when the cached keys can be
 /// returned directly (no refetch needed).
 ///
 /// Logic: use the cache iff it is *fresh* (within TTL) AND either the kid

---- server::jwks::tests::test_cache_entry_is_fresh_past_is_false stdout ----

thread 'server::jwks::tests::test_cache_entry_is_fresh_past_is_false' (11358653) panicked at src/server/jwks.rs:723:9:
assertion failed: !cache_entry_is_fresh(now - Duration::from_secs(1), now)

---- server::jwks::tests::test_cache_entry_is_fresh_equal_is_false stdout ----

thread 'server::jwks::tests::test_cache_entry_is_fresh_equal_is_false' (11358651) panicked at src/server/jwks.rs:732:9:
assertion failed: !cache_entry_is_fresh(now, now)

failures:
    server::jwks::tests::test_cache_entry_is_fresh_equal_is_false
    server::jwks::tests::test_cache_entry_is_fresh_past_is_false

test result: FAILED. 157 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.32s

*** result: Failure(101)
