*** src/server/jwks.rs:226:21: replace < with == in jwks_cache_should_be_used

*** mutation diff:
--- src/server/jwks.rs
+++ replace < with == in jwks_cache_should_be_used
@@ -218,17 +218,17 @@
 /// are pinned by unit tests. Returns true when the cached keys can be
 /// returned directly (no refetch needed).
 ///
 /// Logic: use the cache iff it is *fresh* (within TTL) AND either the kid
 /// is present OR we have not yet cooled down enough to allow a kid-miss
 /// refetch. The cooldown rate-limits refetches against the IdP when an
 /// attacker fires garbage `kid`s at us.
 fn jwks_cache_should_be_used(age: Duration, kid_present: bool) -> bool {
-    let fresh = age < JWKS_CACHE_TTL;
+    let fresh = age == /* ~ changed by cargo-mutants ~ */ JWKS_CACHE_TTL;
     let cooled_down = age >= KID_MISS_REFRESH_COOLDOWN;
     fresh && (kid_present || !cooled_down)
 }
 
 fn sha256_token(token: &str) -> [u8; 32] {
     let mut h = Sha256::new();
     h.update(token.as_bytes());
     h.finalize().into()

---- server::jwks::tests::jwks_cache_boundary_at_ttl_exact stdout ----

thread 'server::jwks::tests::jwks_cache_boundary_at_ttl_exact' (11374693) panicked at src/server/jwks.rs:795:9:
assertion failed: !jwks_cache_should_be_used(JWKS_CACHE_TTL, true)

---- server::jwks::tests::jwks_cache_use_when_kid_missing_but_within_cooldown stdout ----

thread 'server::jwks::tests::jwks_cache_use_when_kid_missing_but_within_cooldown' (11374698) panicked at src/server/jwks.rs:764:9:
assertion failed: jwks_cache_should_be_used(Duration::from_secs(5), false)

---- server::jwks::tests::jwks_cache_use_fresh_kid_present stdout ----

thread 'server::jwks::tests::jwks_cache_use_fresh_kid_present' (11374697) panicked at src/server/jwks.rs:743:9:
assertion failed: jwks_cache_should_be_used(Duration::from_secs(10), true)

failures:
    server::jwks::tests::jwks_cache_boundary_at_ttl_exact
    server::jwks::tests::jwks_cache_use_fresh_kid_present
    server::jwks::tests::jwks_cache_use_when_kid_missing_but_within_cooldown

test result: FAILED. 156 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.36s

*** result: Failure(101)
