*** src/server/jwks.rs:226:5: replace jwks_cache_should_be_used -> bool with true

*** mutation diff:
--- src/server/jwks.rs
+++ replace jwks_cache_should_be_used -> bool with true
@@ -218,19 +218,17 @@
 /// are pinned by unit tests. Returns true when the cached keys can be
 /// returned directly (no refetch needed).
 ///
 /// Logic: use the cache iff it is *fresh* (within TTL) AND either the kid
 /// is present OR we have not yet cooled down enough to allow a kid-miss
 /// refetch. The cooldown rate-limits refetches against the IdP when an
 /// attacker fires garbage `kid`s at us.
 fn jwks_cache_should_be_used(age: Duration, kid_present: bool) -> bool {
-    let fresh = age < JWKS_CACHE_TTL;
-    let cooled_down = age >= KID_MISS_REFRESH_COOLDOWN;
-    fresh && (kid_present || !cooled_down)
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn sha256_token(token: &str) -> [u8; 32] {
     let mut h = Sha256::new();
     h.update(token.as_bytes());
     h.finalize().into()
 }

---- server::jwks::tests::jwks_cache_boundary_at_cooldown_exact stdout ----

thread 'server::jwks::tests::jwks_cache_boundary_at_cooldown_exact' (11365277) panicked at src/server/jwks.rs:783:9:
assertion failed: !jwks_cache_should_be_used(KID_MISS_REFRESH_COOLDOWN, false)

---- server::jwks::tests::jwks_cache_no_use_when_kid_missing_past_cooldown stdout ----

thread 'server::jwks::tests::jwks_cache_no_use_when_kid_missing_past_cooldown' (11365279) panicked at src/server/jwks.rs:773:9:
assertion failed: !jwks_cache_should_be_used(KID_MISS_REFRESH_COOLDOWN + Duration::from_secs(1),
        false)

---- server::jwks::tests::jwks_cache_boundary_at_ttl_exact stdout ----

thread 'server::jwks::tests::jwks_cache_boundary_at_ttl_exact' (11365278) panicked at src/server/jwks.rs:793:9:
assertion failed: !jwks_cache_should_be_used(JWKS_CACHE_TTL, true)

failures:
    server::jwks::tests::jwks_cache_boundary_at_cooldown_exact
    server::jwks::tests::jwks_cache_boundary_at_ttl_exact
    server::jwks::tests::jwks_cache_no_use_when_kid_missing_past_cooldown
    server::jwks::tests::jwks_cache_no_use_when_stale

test result: FAILED. 155 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.30s

*** result: Failure(101)
