*** src/server/jwks.rs:226:5: replace jwks_cache_should_be_used -> bool with false

*** mutation diff:
--- src/server/jwks.rs
+++ replace jwks_cache_should_be_used -> bool with false
@@ -218,19 +218,17 @@
 /// are pinned by unit tests. Returns true when the cached keys can be
 /// returned directly (no refetch needed).
 ///
 /// Logic: use the cache iff it is *fresh* (within TTL) AND either the kid
 /// is present OR we have not yet cooled down enough to allow a kid-miss
 /// refetch. The cooldown rate-limits refetches against the IdP when an
 /// attacker fires garbage `kid`s at us.
 fn jwks_cache_should_be_used(age: Duration, kid_present: bool) -> bool {
-    let fresh = age < JWKS_CACHE_TTL;
-    let cooled_down = age >= KID_MISS_REFRESH_COOLDOWN;
-    fresh && (kid_present || !cooled_down)
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn sha256_token(token: &str) -> [u8; 32] {
     let mut h = Sha256::new();
     h.update(token.as_bytes());
     h.finalize().into()
 }

---- server::jwks::tests::jwks_cache_use_fresh_kid_present stdout ----

thread 'server::jwks::tests::jwks_cache_use_fresh_kid_present' (11368365) panicked at src/server/jwks.rs:741:9:
assertion failed: jwks_cache_should_be_used(Duration::from_secs(10), true)

---- server::jwks::tests::jwks_cache_use_when_kid_missing_but_within_cooldown stdout ----

thread 'server::jwks::tests::jwks_cache_use_when_kid_missing_but_within_cooldown' (11368366) panicked at src/server/jwks.rs:762:9:
assertion failed: jwks_cache_should_be_used(Duration::from_secs(5), false)

failures:
    server::jwks::tests::jwks_cache_use_fresh_kid_present
    server::jwks::tests::jwks_cache_use_when_kid_missing_but_within_cooldown

test result: FAILED. 157 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.38s

*** result: Failure(101)
