*** src/server/jwks.rs:228:11: replace && with || in jwks_cache_should_be_used

*** mutation diff:
--- src/server/jwks.rs
+++ replace && with || in jwks_cache_should_be_used
@@ -220,17 +220,17 @@
 ///
 /// Logic: use the cache iff it is *fresh* (within TTL) AND either the kid
 /// is present OR we have not yet cooled down enough to allow a kid-miss
 /// refetch. The cooldown rate-limits refetches against the IdP when an
 /// attacker fires garbage `kid`s at us.
 fn jwks_cache_should_be_used(age: Duration, kid_present: bool) -> bool {
     let fresh = age < JWKS_CACHE_TTL;
     let cooled_down = age >= KID_MISS_REFRESH_COOLDOWN;
-    fresh && (kid_present || !cooled_down)
+    fresh || /* ~ changed by cargo-mutants ~ */ (kid_present || !cooled_down)
 }
 
 fn sha256_token(token: &str) -> [u8; 32] {
     let mut h = Sha256::new();
     h.update(token.as_bytes());
     h.finalize().into()
 }

---- server::jwks::tests::jwks_cache_boundary_at_cooldown_exact stdout ----

thread 'server::jwks::tests::jwks_cache_boundary_at_cooldown_exact' (11395876) panicked at src/server/jwks.rs:785:9:
assertion failed: !jwks_cache_should_be_used(KID_MISS_REFRESH_COOLDOWN, false)

---- server::jwks::tests::jwks_cache_boundary_at_ttl_exact stdout ----

thread 'server::jwks::tests::jwks_cache_boundary_at_ttl_exact' (11395877) panicked at src/server/jwks.rs:795:9:
assertion failed: !jwks_cache_should_be_used(JWKS_CACHE_TTL, true)

---- server::jwks::tests::jwks_cache_no_use_when_kid_missing_past_cooldown stdout ----

thread 'server::jwks::tests::jwks_cache_no_use_when_kid_missing_past_cooldown' (11395878) panicked at src/server/jwks.rs:775:9:
assertion failed: !jwks_cache_should_be_used(KID_MISS_REFRESH_COOLDOWN + Duration::from_secs(1),
        false)

failures:
    server::jwks::tests::jwks_cache_boundary_at_cooldown_exact
    server::jwks::tests::jwks_cache_boundary_at_ttl_exact
    server::jwks::tests::jwks_cache_no_use_when_kid_missing_past_cooldown
    server::jwks::tests::jwks_cache_no_use_when_stale

test result: FAILED. 155 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.28s

*** result: Failure(101)
