*** src/server/jwks.rs:228:27: replace || with && in jwks_cache_should_be_used

*** mutation diff:
--- src/server/jwks.rs
+++ replace || with && in jwks_cache_should_be_used
@@ -220,17 +220,17 @@
 ///
 /// Logic: use the cache iff it is *fresh* (within TTL) AND either the kid
 /// is present OR we have not yet cooled down enough to allow a kid-miss
 /// refetch. The cooldown rate-limits refetches against the IdP when an
 /// attacker fires garbage `kid`s at us.
 fn jwks_cache_should_be_used(age: Duration, kid_present: bool) -> bool {
     let fresh = age < JWKS_CACHE_TTL;
     let cooled_down = age >= KID_MISS_REFRESH_COOLDOWN;
-    fresh && (kid_present || !cooled_down)
+    fresh && (kid_present && /* ~ changed by cargo-mutants ~ */ !cooled_down)
 }
 
 fn sha256_token(token: &str) -> [u8; 32] {
     let mut h = Sha256::new();
     h.update(token.as_bytes());
     h.finalize().into()
 }

---- server::jwks::tests::jwks_cache_use_when_kid_missing_but_within_cooldown stdout ----

thread 'server::jwks::tests::jwks_cache_use_when_kid_missing_but_within_cooldown' (11402653) panicked at src/server/jwks.rs:764:9:
assertion failed: jwks_cache_should_be_used(Duration::from_secs(5), false)

failures:
    server::jwks::tests::jwks_cache_use_when_kid_missing_but_within_cooldown

test result: FAILED. 158 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.34s

*** result: Failure(101)
