*** src/server/jwks.rs:228:30: delete ! in jwks_cache_should_be_used

*** mutation diff:
--- src/server/jwks.rs
+++ delete ! in jwks_cache_should_be_used
@@ -220,17 +220,17 @@
 ///
 /// Logic: use the cache iff it is *fresh* (within TTL) AND either the kid
 /// is present OR we have not yet cooled down enough to allow a kid-miss
 /// refetch. The cooldown rate-limits refetches against the IdP when an
 /// attacker fires garbage `kid`s at us.
 fn jwks_cache_should_be_used(age: Duration, kid_present: bool) -> bool {
     let fresh = age < JWKS_CACHE_TTL;
     let cooled_down = age >= KID_MISS_REFRESH_COOLDOWN;
-    fresh && (kid_present || !cooled_down)
+    fresh && (kid_present ||  /* ~ changed by cargo-mutants ~ */cooled_down)
 }
 
 fn sha256_token(token: &str) -> [u8; 32] {
     let mut h = Sha256::new();
     h.update(token.as_bytes());
     h.finalize().into()
 }

---- server::jwks::tests::jwks_cache_no_use_when_kid_missing_past_cooldown stdout ----

thread 'server::jwks::tests::jwks_cache_no_use_when_kid_missing_past_cooldown' (11410393) panicked at src/server/jwks.rs:775:9:
assertion failed: !jwks_cache_should_be_used(KID_MISS_REFRESH_COOLDOWN + Duration::from_secs(1),
        false)

---- server::jwks::tests::jwks_cache_boundary_at_cooldown_exact stdout ----

thread 'server::jwks::tests::jwks_cache_boundary_at_cooldown_exact' (11410391) panicked at src/server/jwks.rs:785:9:
assertion failed: !jwks_cache_should_be_used(KID_MISS_REFRESH_COOLDOWN, false)

---- server::jwks::tests::jwks_cache_use_when_kid_missing_but_within_cooldown stdout ----

thread 'server::jwks::tests::jwks_cache_use_when_kid_missing_but_within_cooldown' (11410396) panicked at src/server/jwks.rs:764:9:
assertion failed: jwks_cache_should_be_used(Duration::from_secs(5), false)

failures:
    server::jwks::tests::jwks_cache_boundary_at_cooldown_exact
    server::jwks::tests::jwks_cache_no_use_when_kid_missing_past_cooldown
    server::jwks::tests::jwks_cache_use_when_kid_missing_but_within_cooldown

test result: FAILED. 156 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.35s

*** result: Failure(101)
