*** src/server/jwks.rs:305:9: delete match arm "PS384" in parse_algorithm

*** mutation diff:
--- src/server/jwks.rs
+++ delete match arm "PS384" in parse_algorithm
@@ -297,17 +297,17 @@
     let alg = algorithms.first().map(|s| s.as_str()).unwrap_or("RS256");
     match alg {
         "RS256" => Ok(Algorithm::RS256),
         "RS384" => Ok(Algorithm::RS384),
         "RS512" => Ok(Algorithm::RS512),
         "ES256" => Ok(Algorithm::ES256),
         "ES384" => Ok(Algorithm::ES384),
         "PS256" => Ok(Algorithm::PS256),
-        "PS384" => Ok(Algorithm::PS384),
+         /* ~ changed by cargo-mutants ~ */
         "PS512" => Ok(Algorithm::PS512),
         "EdDSA" => Ok(Algorithm::EdDSA),
         _ => anyhow::bail!("Unsupported algorithm: {alg}"),
     }
 }
 
 fn build_decoding_key(key: &Jwk) -> Result<DecodingKey> {
     match key.kty.as_str() {

---- server::jwks::tests::test_parse_algorithm_ps384 stdout ----

thread 'server::jwks::tests::test_parse_algorithm_ps384' (11435972) panicked at src/server/jwks.rs:389:59:
called `Result::unwrap()` on an `Err` value: Unsupported algorithm: PS384

failures:
    server::jwks::tests::test_parse_algorithm_ps384

test result: FAILED. 158 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.35s

*** result: Failure(101)
