*** src/server/ssh.rs:100:31: replace - with + in strip_surrounding_quotes

*** mutation diff:
--- src/server/ssh.rs
+++ replace - with + in strip_surrounding_quotes
@@ -92,17 +92,17 @@
 
 /// Strip surrounding `"` from a value if both are present and the input
 /// has length >= 2. Returns the inner string in that case, or the input
 /// unchanged otherwise. Pure so the three-way `&&` chain is exercised
 /// directly by unit tests -- mutation testing flagged the chain as
 /// under-covered by header-level tests.
 fn strip_surrounding_quotes(value: &str) -> &str {
     if value.starts_with('"') && value.ends_with('"') && value.len() >= 2 {
-        &value[1..value.len() - 1]
+        &value[1..value.len() + /* ~ changed by cargo-mutants ~ */ 1]
     } else {
         value
     }
 }
 
 /// Split a header value by commas while respecting double-quoted strings.
 ///
 /// A quoted string like `signature="a,b"` will not be split at the inner

---- server::ssh::tests::strip_quotes_just_two_quotes_yields_empty stdout ----

thread 'server::ssh::tests::strip_quotes_just_two_quotes_yields_empty' (11494201) panicked at src/server/ssh.rs:100:15:
byte index 3 is out of bounds of `""`

---- server::ssh::tests::strip_quotes_both_ends_long_enough stdout ----

thread 'server::ssh::tests::strip_quotes_both_ends_long_enough' (11494200) panicked at src/server/ssh.rs:100:15:
byte index 4 is out of bounds of `"x"`

---- server::ssh::tests::test_parse_valid_header stdout ----

thread 'server::ssh::tests::test_parse_valid_header' (11494230) panicked at src/server/ssh.rs:100:15:
byte index 16 is out of bounds of `"SHA256:abc123"`

failures:
    server::ssh::tests::strip_quotes_both_ends_long_enough
    server::ssh::tests::strip_quotes_just_two_quotes_yields_empty
    server::ssh::tests::test_end_to_end_verify_succeeds
    server::ssh::tests::test_parse_empty_quoted_value
    server::ssh::tests::test_parse_missing_fingerprint
    server::ssh::tests::test_parse_missing_nonce
    server::ssh::tests::test_parse_missing_signature
    server::ssh::tests::test_parse_missing_timestamp
    server::ssh::tests::test_parse_unknown_keys_ignored
    server::ssh::tests::test_parse_valid_header
    server::ssh::tests::test_parse_value_only_leading_quote
    server::ssh::tests::test_unknown_fingerprint_error_is_redacted

test result: FAILED. 142 passed; 17 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.29s

*** result: Failure(101)
