*** src/server/ssh.rs:111:5: replace split_header_params -> Vec<String> with vec![String::new()]

*** mutation diff:
--- src/server/ssh.rs
+++ replace split_header_params -> Vec<String> with vec![String::new()]
@@ -103,39 +103,17 @@
     }
 }
 
 /// Split a header value by commas while respecting double-quoted strings.
 ///
 /// A quoted string like `signature="a,b"` will not be split at the inner
 /// comma.
 pub fn split_header_params(header: &str) -> Vec<String> {
-    let mut parts = Vec::new();
-    let mut current = String::new();
-    let mut in_quotes = false;
-
-    for ch in header.chars() {
-        match ch {
-            '"' => {
-                in_quotes = !in_quotes;
-                current.push(ch);
-            }
-            ',' if !in_quotes => {
-                parts.push(current.trim().to_string());
-                current = String::new();
-            }
-            _ => current.push(ch),
-        }
-    }
-
-    if !current.trim().is_empty() {
-        parts.push(current.trim().to_string());
-    }
-
-    parts
+    vec![String::new()] /* ~ changed by cargo-mutants ~ */
 }
 
 // ──────────────────────────────────────────────────────────────────────────────
 // Task 3: Nonce tracker for replay protection
 // ──────────────────────────────────────────────────────────────────────────────
 
 /// Tracks seen nonces to prevent replay attacks.
 ///

---- server::ssh::tests::split_trims_whitespace stdout ----

thread 'server::ssh::tests::split_trims_whitespace' (11495560) panicked at src/server/ssh.rs:580:9:
assertion `left == right` failed
  left: [""]
 right: ["a=1", "b=2"]

---- server::ssh::tests::split_preserves_quoted_comma stdout ----

thread 'server::ssh::tests::split_preserves_quoted_comma' (11495559) panicked at src/server/ssh.rs:564:9:
assertion `left == right` failed
  left: [""]
 right: ["a=\"x,y\"", "b=\"z\""]

---- server::ssh::tests::split_handles_unquoted stdout ----

thread 'server::ssh::tests::split_handles_unquoted' (11495558) panicked at src/server/ssh.rs:574:9:
assertion `left == right` failed
  left: [""]
 right: ["a=1", "b=2", "c=3"]

failures:
    server::ssh::tests::split_handles_unquoted
    server::ssh::tests::split_preserves_quoted_comma
    server::ssh::tests::split_trims_whitespace
    server::ssh::tests::test_end_to_end_verify_succeeds
    server::ssh::tests::test_parse_empty_quoted_value
    server::ssh::tests::test_parse_unknown_keys_ignored
    server::ssh::tests::test_parse_valid_header
    server::ssh::tests::test_parse_value_no_quotes_unwrapped_directly
    server::ssh::tests::test_unknown_fingerprint_error_is_redacted
    server::ssh::tests::test_verify_drift_at_boundary_accepted
    server::ssh::tests::test_verify_drift_one_past_boundary_rejected
    server::ssh::tests::test_verify_rejects_expired_timestamp

test result: FAILED. 145 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.27s

*** result: Failure(101)
