*** src/server/ssh.rs:117:13: delete match arm '"' in split_header_params

*** mutation diff:
--- src/server/ssh.rs
+++ delete match arm '"' in split_header_params
@@ -109,20 +109,17 @@
 /// comma.
 pub fn split_header_params(header: &str) -> Vec<String> {
     let mut parts = Vec::new();
     let mut current = String::new();
     let mut in_quotes = false;
 
     for ch in header.chars() {
         match ch {
-            '"' => {
-                in_quotes = !in_quotes;
-                current.push(ch);
-            }
+             /* ~ changed by cargo-mutants ~ */
             ',' if !in_quotes => {
                 parts.push(current.trim().to_string());
                 current = String::new();
             }
             _ => current.push(ch),
         }
     }

---- server::ssh::tests::split_preserves_quoted_comma stdout ----

thread 'server::ssh::tests::split_preserves_quoted_comma' (11496467) panicked at src/server/ssh.rs:583:9:
assertion `left == right` failed
  left: ["a=\"x", "y\"", "b=\"z\""]
 right: ["a=\"x,y\"", "b=\"z\""]

failures:
    server::ssh::tests::split_preserves_quoted_comma

test result: FAILED. 158 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.28s

*** result: Failure(101)
