*** src/server/ssh.rs:121:20: replace match guard !in_quotes with true in split_header_params

*** mutation diff:
--- src/server/ssh.rs
+++ replace match guard !in_quotes with true in split_header_params
@@ -113,17 +113,17 @@
     let mut in_quotes = false;
 
     for ch in header.chars() {
         match ch {
             '"' => {
                 in_quotes = !in_quotes;
                 current.push(ch);
             }
-            ',' if !in_quotes => {
+            ',' if true /* ~ changed by cargo-mutants ~ */ => {
                 parts.push(current.trim().to_string());
                 current = String::new();
             }
             _ => current.push(ch),
         }
     }
 
     if !current.trim().is_empty() {

---- server::ssh::tests::split_preserves_quoted_comma stdout ----

thread 'server::ssh::tests::split_preserves_quoted_comma' (11496916) panicked at src/server/ssh.rs:586:9:
assertion `left == right` failed
  left: ["a=\"x", "y\"", "b=\"z\""]
 right: ["a=\"x,y\"", "b=\"z\""]

failures:
    server::ssh::tests::split_preserves_quoted_comma

test result: FAILED. 158 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.27s

*** result: Failure(101)
