*** src/server/ssh.rs:121:20: delete ! in split_header_params

*** mutation diff:
--- src/server/ssh.rs
+++ delete ! in split_header_params
@@ -113,17 +113,17 @@
     let mut in_quotes = false;
 
     for ch in header.chars() {
         match ch {
             '"' => {
                 in_quotes = !in_quotes;
                 current.push(ch);
             }
-            ',' if !in_quotes => {
+            ',' if  /* ~ changed by cargo-mutants ~ */in_quotes => {
                 parts.push(current.trim().to_string());
                 current = String::new();
             }
             _ => current.push(ch),
         }
     }
 
     if !current.trim().is_empty() {

---- server::ssh::tests::split_preserves_quoted_comma stdout ----

thread 'server::ssh::tests::split_preserves_quoted_comma' (11498375) panicked at src/server/ssh.rs:586:9:
assertion `left == right` failed
  left: ["a=\"x", "y\",b=\"z\""]
 right: ["a=\"x,y\"", "b=\"z\""]

---- server::ssh::tests::split_trims_whitespace stdout ----

thread 'server::ssh::tests::split_trims_whitespace' (11498376) panicked at src/server/ssh.rs:602:9:
assertion `left == right` failed
  left: ["a=1 , b=2"]
 right: ["a=1", "b=2"]

---- server::ssh::tests::split_handles_unquoted stdout ----

thread 'server::ssh::tests::split_handles_unquoted' (11498374) panicked at src/server/ssh.rs:596:9:
assertion `left == right` failed
  left: ["a=1,b=2,c=3"]
 right: ["a=1", "b=2", "c=3"]

failures:
    server::ssh::tests::split_handles_unquoted
    server::ssh::tests::split_preserves_quoted_comma
    server::ssh::tests::split_trims_whitespace
    server::ssh::tests::test_end_to_end_verify_succeeds
    server::ssh::tests::test_parse_empty_quoted_value
    server::ssh::tests::test_parse_unknown_keys_ignored
    server::ssh::tests::test_parse_valid_header
    server::ssh::tests::test_parse_value_no_quotes_unwrapped_directly
    server::ssh::tests::test_unknown_fingerprint_error_is_redacted
    server::ssh::tests::test_verify_drift_at_boundary_accepted
    server::ssh::tests::test_verify_drift_one_past_boundary_rejected
    server::ssh::tests::test_verify_rejects_expired_timestamp

test result: FAILED. 145 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.28s

*** result: Failure(101)
