*** src/server/ssh.rs:199:13: replace < with == in nonce_is_within_window

*** mutation diff:
--- src/server/ssh.rs
+++ replace < with == in nonce_is_within_window
@@ -191,17 +191,17 @@
 /// duration (rather than an `Instant`) so unit tests can pin the boundary
 /// exactly -- with a wall-clock `Instant::elapsed()` inside the function,
 /// the boundary moment can never be hit deterministically.
 ///
 /// Mutation testing flagged the `<` operator: `<` -> `<=` would treat a
 /// nonce inserted *exactly* `max_age` ago as still-replaying; `<` -> `>`
 /// would invert the window. Tests `nonce_is_within_window_*` kill these.
 fn nonce_is_within_window(elapsed: Duration, max_age: Duration) -> bool {
-    elapsed < max_age
+    elapsed == /* ~ changed by cargo-mutants ~ */ max_age
 }
 
 // ──────────────────────────────────────────────────────────────────────────────
 // Task 4: SSHSIG verification
 // ──────────────────────────────────────────────────────────────────────────────
 
 /// A parsed and pre-validated entry from an `authorized_keys` file.
 #[derive(Clone, Debug)]

---- server::ssh::tests::nonce_just_inside_window_is_within stdout ----

thread 'server::ssh::tests::nonce_just_inside_window_is_within' (11500307) panicked at src/server/ssh.rs:675:9:
assertion failed: nonce_is_within_window(max_age - Duration::from_nanos(1), max_age)

---- server::ssh::tests::nonce_at_window_exact_is_outside stdout ----

thread 'server::ssh::tests::nonce_at_window_exact_is_outside' (11500306) panicked at src/server/ssh.rs:655:9:
assertion failed: !nonce_is_within_window(Duration::from_secs(60), Duration::from_secs(60))

---- server::ssh::tests::nonce_within_window_zero_elapsed stdout ----

thread 'server::ssh::tests::nonce_within_window_zero_elapsed' (11500309) panicked at src/server/ssh.rs:644:9:
assertion failed: nonce_is_within_window(Duration::ZERO, Duration::from_secs(60))

failures:
    server::ssh::tests::nonce_at_window_exact_is_outside
    server::ssh::tests::nonce_just_inside_window_is_within
    server::ssh::tests::nonce_within_window_zero_elapsed
    server::ssh::tests::test_nonce_concurrent_check_and_insert_is_atomic
    server::ssh::tests::test_nonce_replay_returns_true

test result: FAILED. 154 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.27s

*** result: Failure(101)
