*** src/server/ssh.rs:199:13: replace < with <= in nonce_is_within_window

*** mutation diff:
--- src/server/ssh.rs
+++ replace < with <= in nonce_is_within_window
@@ -191,17 +191,17 @@
 /// duration (rather than an `Instant`) so unit tests can pin the boundary
 /// exactly -- with a wall-clock `Instant::elapsed()` inside the function,
 /// the boundary moment can never be hit deterministically.
 ///
 /// Mutation testing flagged the `<` operator: `<` -> `<=` would treat a
 /// nonce inserted *exactly* `max_age` ago as still-replaying; `<` -> `>`
 /// would invert the window. Tests `nonce_is_within_window_*` kill these.
 fn nonce_is_within_window(elapsed: Duration, max_age: Duration) -> bool {
-    elapsed < max_age
+    elapsed <= /* ~ changed by cargo-mutants ~ */ max_age
 }
 
 // ──────────────────────────────────────────────────────────────────────────────
 // Task 4: SSHSIG verification
 // ──────────────────────────────────────────────────────────────────────────────
 
 /// A parsed and pre-validated entry from an `authorized_keys` file.
 #[derive(Clone, Debug)]

---- server::ssh::tests::nonce_at_window_exact_is_outside stdout ----

thread 'server::ssh::tests::nonce_at_window_exact_is_outside' (11501220) panicked at src/server/ssh.rs:655:9:
assertion failed: !nonce_is_within_window(Duration::from_secs(60), Duration::from_secs(60))

failures:
    server::ssh::tests::nonce_at_window_exact_is_outside

test result: FAILED. 158 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.28s

*** result: Failure(101)
