*** src/server/ssh.rs:199:5: replace nonce_is_within_window -> bool with true

*** mutation diff:
--- src/server/ssh.rs
+++ replace nonce_is_within_window -> bool with true
@@ -191,17 +191,17 @@
 /// duration (rather than an `Instant`) so unit tests can pin the boundary
 /// exactly -- with a wall-clock `Instant::elapsed()` inside the function,
 /// the boundary moment can never be hit deterministically.
 ///
 /// Mutation testing flagged the `<` operator: `<` -> `<=` would treat a
 /// nonce inserted *exactly* `max_age` ago as still-replaying; `<` -> `>`
 /// would invert the window. Tests `nonce_is_within_window_*` kill these.
 fn nonce_is_within_window(elapsed: Duration, max_age: Duration) -> bool {
-    elapsed < max_age
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 // ──────────────────────────────────────────────────────────────────────────────
 // Task 4: SSHSIG verification
 // ──────────────────────────────────────────────────────────────────────────────
 
 /// A parsed and pre-validated entry from an `authorized_keys` file.
 #[derive(Clone, Debug)]

---- server::ssh::tests::nonce_past_window_is_outside stdout ----

thread 'server::ssh::tests::nonce_past_window_is_outside' (11499273) panicked at src/server/ssh.rs:664:9:
assertion failed: !nonce_is_within_window(Duration::from_secs(120), Duration::from_secs(60))

---- server::ssh::tests::nonce_at_window_exact_is_outside stdout ----

thread 'server::ssh::tests::nonce_at_window_exact_is_outside' (11499271) panicked at src/server/ssh.rs:655:9:
assertion failed: !nonce_is_within_window(Duration::from_secs(60), Duration::from_secs(60))

---- server::ssh::tests::test_expired_nonce_can_be_reused stdout ----

thread 'server::ssh::tests::test_expired_nonce_can_be_reused' (11499288) panicked at src/server/ssh.rs:633:9:
assertion failed: !tracker.check_and_insert("nonce1").await

failures:
    server::ssh::tests::nonce_at_window_exact_is_outside
    server::ssh::tests::nonce_past_window_is_outside
    server::ssh::tests::test_expired_nonce_can_be_reused

test result: FAILED. 156 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.29s

*** result: Failure(101)
