*** src/server/ssh.rs:199:5: replace nonce_is_within_window -> bool with false

*** mutation diff:
--- src/server/ssh.rs
+++ replace nonce_is_within_window -> bool with false
@@ -191,17 +191,17 @@
 /// duration (rather than an `Instant`) so unit tests can pin the boundary
 /// exactly -- with a wall-clock `Instant::elapsed()` inside the function,
 /// the boundary moment can never be hit deterministically.
 ///
 /// Mutation testing flagged the `<` operator: `<` -> `<=` would treat a
 /// nonce inserted *exactly* `max_age` ago as still-replaying; `<` -> `>`
 /// would invert the window. Tests `nonce_is_within_window_*` kill these.
 fn nonce_is_within_window(elapsed: Duration, max_age: Duration) -> bool {
-    elapsed < max_age
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 // ──────────────────────────────────────────────────────────────────────────────
 // Task 4: SSHSIG verification
 // ──────────────────────────────────────────────────────────────────────────────
 
 /// A parsed and pre-validated entry from an `authorized_keys` file.
 #[derive(Clone, Debug)]

---- server::ssh::tests::nonce_just_inside_window_is_within stdout ----

thread 'server::ssh::tests::nonce_just_inside_window_is_within' (11499858) panicked at src/server/ssh.rs:675:9:
assertion failed: nonce_is_within_window(max_age - Duration::from_nanos(1), max_age)

---- server::ssh::tests::nonce_within_window_zero_elapsed stdout ----

thread 'server::ssh::tests::nonce_within_window_zero_elapsed' (11499860) panicked at src/server/ssh.rs:644:9:
assertion failed: nonce_is_within_window(Duration::ZERO, Duration::from_secs(60))

---- server::ssh::tests::test_nonce_replay_returns_true stdout ----

thread 'server::ssh::tests::test_nonce_replay_returns_true' (11499877) panicked at src/server/ssh.rs:617:9:
assertion failed: tracker.check_and_insert("nonce1").await

failures:
    server::ssh::tests::nonce_just_inside_window_is_within
    server::ssh::tests::nonce_within_window_zero_elapsed
    server::ssh::tests::test_nonce_concurrent_check_and_insert_is_atomic
    server::ssh::tests::test_nonce_replay_returns_true

test result: FAILED. 155 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.29s

*** result: Failure(101)
