*** src/server/ssh.rs:99:5: replace strip_surrounding_quotes -> &str with ""

*** mutation diff:
--- src/server/ssh.rs
+++ replace strip_surrounding_quotes -> &str with ""
@@ -91,21 +91,17 @@
 }
 
 /// Strip surrounding `"` from a value if both are present and the input
 /// has length >= 2. Returns the inner string in that case, or the input
 /// unchanged otherwise. Pure so the three-way `&&` chain is exercised
 /// directly by unit tests -- mutation testing flagged the chain as
 /// under-covered by header-level tests.
 fn strip_surrounding_quotes(value: &str) -> &str {
-    if value.starts_with('"') && value.ends_with('"') && value.len() >= 2 {
-        &value[1..value.len() - 1]
-    } else {
-        value
-    }
+    "" /* ~ changed by cargo-mutants ~ */
 }
 
 /// Split a header value by commas while respecting double-quoted strings.
 ///
 /// A quoted string like `signature="a,b"` will not be split at the inner
 /// comma.
 pub fn split_header_params(header: &str) -> Vec<String> {
     let mut parts = Vec::new();

---- server::ssh::tests::strip_quotes_only_leading_quote_keeps_input stdout ----

thread 'server::ssh::tests::strip_quotes_only_leading_quote_keeps_input' (11486009) panicked at src/server/ssh.rs:549:9:
assertion `left == right` failed
  left: ""
 right: "\"abc"

---- server::ssh::tests::strip_quotes_only_trailing_quote_keeps_input stdout ----

thread 'server::ssh::tests::strip_quotes_only_trailing_quote_keeps_input' (11486010) panicked at src/server/ssh.rs:555:9:
assertion `left == right` failed
  left: ""
 right: "abc\""

---- server::ssh::tests::strip_quotes_both_ends_long_enough stdout ----

thread 'server::ssh::tests::strip_quotes_both_ends_long_enough' (11486006) panicked at src/server/ssh.rs:536:9:
assertion `left == right` failed
  left: ""
 right: "x"

failures:
    server::ssh::tests::strip_quotes_both_ends_long_enough
    server::ssh::tests::strip_quotes_no_quotes_keeps_input
    server::ssh::tests::strip_quotes_only_leading_quote_keeps_input
    server::ssh::tests::strip_quotes_only_trailing_quote_keeps_input
    server::ssh::tests::strip_quotes_single_quote_does_not_panic
    server::ssh::tests::test_end_to_end_verify_succeeds
    server::ssh::tests::test_parse_valid_header
    server::ssh::tests::test_parse_value_no_quotes_unwrapped_directly
    server::ssh::tests::test_unknown_fingerprint_error_is_redacted
    server::ssh::tests::test_verify_drift_at_boundary_accepted

test result: FAILED. 149 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.34s

*** result: Failure(101)
