*** src/server/ssh.rs:99:55: replace && with || in strip_surrounding_quotes

*** mutation diff:
--- src/server/ssh.rs
+++ replace && with || in strip_surrounding_quotes
@@ -91,17 +91,17 @@
 }
 
 /// Strip surrounding `"` from a value if both are present and the input
 /// has length >= 2. Returns the inner string in that case, or the input
 /// unchanged otherwise. Pure so the three-way `&&` chain is exercised
 /// directly by unit tests -- mutation testing flagged the chain as
 /// under-covered by header-level tests.
 fn strip_surrounding_quotes(value: &str) -> &str {
-    if value.starts_with('"') && value.ends_with('"') && value.len() >= 2 {
+    if value.starts_with('"') && value.ends_with('"') || /* ~ changed by cargo-mutants ~ */ value.len() >= 2 {
         &value[1..value.len() - 1]
     } else {
         value
     }
 }
 
 /// Split a header value by commas while respecting double-quoted strings.
 ///

---- server::ssh::tests::strip_quotes_only_trailing_quote_keeps_input stdout ----

thread 'server::ssh::tests::strip_quotes_only_trailing_quote_keeps_input' (11492813) panicked at src/server/ssh.rs:559:9:
assertion `left == right` failed
  left: "bc"
 right: "abc\""

---- server::ssh::tests::strip_quotes_only_leading_quote_keeps_input stdout ----

thread 'server::ssh::tests::strip_quotes_only_leading_quote_keeps_input' (11492812) panicked at src/server/ssh.rs:553:9:
assertion `left == right` failed
  left: "ab"
 right: "\"abc"

---- server::ssh::tests::strip_quotes_single_quote_does_not_panic stdout ----

thread 'server::ssh::tests::strip_quotes_single_quote_does_not_panic' (11492814) panicked at src/server/ssh.rs:100:15:
begin <= end (1 <= 0) when slicing `"`

failures:
    server::ssh::tests::strip_quotes_no_quotes_keeps_input
    server::ssh::tests::strip_quotes_only_leading_quote_keeps_input
    server::ssh::tests::strip_quotes_only_trailing_quote_keeps_input
    server::ssh::tests::strip_quotes_single_quote_does_not_panic
    server::ssh::tests::test_parse_value_no_quotes_unwrapped_directly

test result: FAILED. 154 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.33s

*** result: Failure(101)
