*** src/server/ssh.rs:99:70: replace >= with < in strip_surrounding_quotes

*** mutation diff:
--- src/server/ssh.rs
+++ replace >= with < in strip_surrounding_quotes
@@ -91,17 +91,17 @@
 }
 
 /// Strip surrounding `"` from a value if both are present and the input
 /// has length >= 2. Returns the inner string in that case, or the input
 /// unchanged otherwise. Pure so the three-way `&&` chain is exercised
 /// directly by unit tests -- mutation testing flagged the chain as
 /// under-covered by header-level tests.
 fn strip_surrounding_quotes(value: &str) -> &str {
-    if value.starts_with('"') && value.ends_with('"') && value.len() >= 2 {
+    if value.starts_with('"') && value.ends_with('"') && value.len() < /* ~ changed by cargo-mutants ~ */ 2 {
         &value[1..value.len() - 1]
     } else {
         value
     }
 }
 
 /// Split a header value by commas while respecting double-quoted strings.
 ///

---- server::ssh::tests::strip_quotes_just_two_quotes_yields_empty stdout ----

thread 'server::ssh::tests::strip_quotes_just_two_quotes_yields_empty' (11493759) panicked at src/server/ssh.rs:572:9:
assertion `left == right` failed
  left: "\"\""
 right: ""

---- server::ssh::tests::strip_quotes_both_ends_long_enough stdout ----

thread 'server::ssh::tests::strip_quotes_both_ends_long_enough' (11493758) panicked at src/server/ssh.rs:540:9:
assertion `left == right` failed
  left: "\"x\""
 right: "x"

---- server::ssh::tests::strip_quotes_single_quote_does_not_panic stdout ----

thread 'server::ssh::tests::strip_quotes_single_quote_does_not_panic' (11493763) panicked at src/server/ssh.rs:100:15:
begin <= end (1 <= 0) when slicing `"`

failures:
    server::ssh::tests::strip_quotes_both_ends_long_enough
    server::ssh::tests::strip_quotes_just_two_quotes_yields_empty
    server::ssh::tests::strip_quotes_single_quote_does_not_panic
    server::ssh::tests::test_end_to_end_verify_succeeds
    server::ssh::tests::test_parse_empty_quoted_value
    server::ssh::tests::test_parse_unknown_keys_ignored
    server::ssh::tests::test_parse_valid_header
    server::ssh::tests::test_unknown_fingerprint_error_is_redacted
    server::ssh::tests::test_verify_drift_at_boundary_accepted
    server::ssh::tests::test_verify_drift_one_past_boundary_rejected
    server::ssh::tests::test_verify_rejects_expired_timestamp
    server::ssh::tests::test_verify_rejects_revoked_key

test result: FAILED. 146 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.27s

*** result: Failure(101)
